app/controllers/personas_controller.rb

SELECT "personas".* FROM "personas"
---
    def index
        render json: Persona.all

SELECT "personas".* FROM "personas" WHERE "personas"."id" = 1 LIMIT 1
---
    def show
        render json: Persona.find(params[:id])