app/controllers/restaurantes_controller.rb

SELECT "restaurantes".* FROM "restaurantes"
---
    def index
        render json: Restaurante.all

SELECT "restaurantes".* FROM "restaurantes" WHERE "restaurantes"."id" = 1 LIMIT 1
---
    def show
        render json: Restaurante.find(params[:id])